app/controllers/favorites_controller.rb

SELECT "favorites".* FROM "favorites"
---
  def index
    @favorites = Favorite.all

INSERT INTO "favorites" ("uri", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @favorite = Favorite.new(favorite_params)

    if @favorite.save

SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_favorite
      @favorite = Favorite.find(params[:id])