app/controllers/produces_controller.rb

SELECT "produces".* FROM "produces"
---
  def index
    @produces = Produce.all