app/controllers/users_controller.rb

  def display
    specific_user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "wt08"], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "joe@gmail.com"], ["username", "joe10"], ["created_at", "2020-08-14 16:51:09.677110"], ["updated_at", "2020-08-14 16:51:09.677110"]]